01  WS-AREA-1 PIC 9(5) VALUE 99999. 
01  WS-AREA-2 PIC 9(5). 

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 99999 THEN
        MOVE ZERO TO WS-AREA-1
    END-IF
    MOVE WS-AREA-1 TO WS-AREA-2
    DISPLAY WS-AREA-2
    STOP RUN.